In [2]:
import pandas as pd
import numpy as np

In [5]:
print(f"pandas version info: {pd.__version__}")
print(f"numpy version info: {np.__version__}")

pandas version info: 1.0.5
numpy version info: 1.18.5

# Indexing

### 1. loc로 새로운 칼럼 할당하기 (Assign a new column using loc method)

In [46]:
panda_members = {'Name' : ['Ace', 'Baam', 'Choco', "Dill", "Eren", "Foo"],
                'Bamboo': [20, np.nan, 7, np.nan, np.nan, 20],
                'Water': [30, 40, 10, np.nan, 11, 20,]}


DF = pd.DataFrame.from_dict(panda_members)

In [47]:
DF.loc[:,"Age"]=10

In [45]:
DF

    Name  Bamboo  Water  Age
0    Ace    20.0   30.0   10
1   Baam     NaN   40.0   10
2  Choco     7.0   10.0   10
3   Dill     NaN    NaN   10
4   Eren     NaN   11.0   10
5    Foo    20.0   20.0   10

### 2. 원하는 데이터 타입의 칼럼만 선택하기 (Selecting columns by specific data types)|

In [4]:
panda_members = {'Name' : ['Ace', 'Baam', 'Choco', "Dill", "Eren", "Foo"],
                'Bamboo': [20, np.nan, 7, np.nan, np.nan, 20],
                'Water': [30, 40, 10, np.nan, 11, 20,],
                'Very_Cute': [True, False, True, True, True, True]}

DF = pd.DataFrame.from_dict(panda_members)

DF.select_dtypes("O")
# DF.select_dtypes(include="O")

    Name
0    Ace
1   Baam
2  Choco
3   Dill
4   Eren
5    Foo

In [5]:
DF.select_dtypes(exclude="O")

   Bamboo  Water  Very_Cute
0    20.0   30.0       True
1     NaN   40.0      False
2     7.0   10.0       True
3     NaN    NaN       True
4     NaN   11.0       True
5    20.0   20.0       True